pjjuihj/stm32-ota-bootloader/tests/mock_stm32f4xx_hal_conf.h
/**
  ******************************************************************************
  * @file           : mock_stm32f4xx_hal_conf.h
  * @brief          : HAL 配置文件 (PC 端测试用)
  ******************************************************************************
  */

#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

/* PC 端测试不需要实际 HAL 模块 */
#define HAL_MODULE_ENABLED

#endif /* __STM32F4xx_HAL_CONF_H */
